Revit 2027 API
ExportLineweightTable.GetExportLineweightInfo Method
 Gets a copy of the ExportLineweightInfo corresponding to the given ExportLineweightKey.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportLineweightInfo GetExportLineweightInfo(
	ExportLineweightKey exportLineweightKey
)
Public Function GetExportLineweightInfo (
	exportLineweightKey As ExportLineweightKey
) As ExportLineweightInfo
public:
ExportLineweightInfo^ GetExportLineweightInfo(
	ExportLineweightKey^ exportLineweightKey
)
member GetExportLineweightInfo :
        exportLineweightKey : ExportLineweightKey -> ExportLineweightInfo
Parameters
exportLineweightKey ExportLineweightKey
 The export line weight Key.
Return Value
ExportLineweightInfo
 Returns the line weight info for this key.
Exceptions
Exception | Condition
ArgumentException |  An entry with the given key is not present in the table.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLineweightTable Class
Autodesk.Revit.DB Namespace